{
  "emptyDescription": "The developer has not yet provided a napari-hub specific description.",
  "hubWikiLink": "https://github.com/chanzuckerberg/napari-hub/blob/main/docs/customizing-plugin-listing.md",
  "mismatchWikiLink": "https://github.com/chanzuckerberg/napari-hub/blob/main/docs/setting-up-preview.md#seeing-a-warning-message",

  "sections": {
    "describeWhat": {
      "title": "Describe what the plugin does",
      "description": "A concise summary & clear description help users understand what your plugin does and whether it is what they are looking for."
    },

    "tellUsers": {
      "title": "Tell users where they can get help",
      "description": "Make sure your users know where to go to learn how to use your plugin, get help, report bugs, or request new features."
    },

    "giveInsight": {
      "title": "Give insight into your code",
      "description": "Let users see your source code and know what kind of stability they should expect."
    },

    "specifySystem": {
      "title": "Specify system requirements",
      "description": "Make the technical requirements of your plugin clear so users will know if it they can install it."
    }
  },

  "appBar": {
    "editInGitHub": "Edit in GitHub",
    "learnHow": "Learn how to update fields in the <externalLink href='$t(hubWikiLink)'>napari hub GitHub Wiki</externalLink>.",
    "notLive": "It is not live on the napari hub.",
    "viewPR": "View pull request",

    "previewMessageBase": "This preview of <bold>{{pluginName}}</bold> was generated from <externalLink href='{{pullRequestLink}}'>{{previewRepoName}}</externalLink>",
    "previewMessage": "$t(appBar.previewMessageBase).",
    "previewMessage_mismatch": "$t(appBar.previewMessageBase), but your metadata points to <externalLink href='{{codeRepoLink}}'>{{codeRepoName}}</externalLink> as the source code. <externalLink href='$t(mismatchWikiLink)'>Learn More</externalLink>.",

    "missingFields_zero": "All fields complete!",
    "missingFields_one": "1 field needs attention",
    "missingFields_other": "{{count}} fields needs attention"
  },

  "emptyTooltip": {
    "learnHow": "Learn how to add content for this field in the <hubLink>napari hub GitHub Wiki</hubLink>.",
    "incompleteField": "If this field remains incomplete, it will still be shown on your plugin’s page, but without the orange overlay."
  },

  "tooltips": {
    "name": "There can be only one. This is also the name of your Python package. Learn how to set this.",
    "displayName": "This is the human-readable name of your Python package. Learn how to set this.",
    "description": "Focus on what’s relevant to users who might want to try your plugin. Learn how to set this.",
    "summary": "Stand out with a concise summary of what your plugin does. Learn how to set this.",

    "license": "Help users know how they can modify or redistribute your code. Learn how to set this.",
    "operatingSystems": "Tell your users which operating systems you support. Learn how to set this.",
    "pythonVersion": "Let users know which Python versions you support. Learn how to set this.",
    "requirements": "If your plugin has dependencies on other Python libraries, make sure to add them. Learn how to set this.",
    "version": "Semantic versioning gives users quick insight into breaking changes. Learn how to set this.",

    "authors": "Make sure folks know who’s behind the magic. Learn how to set this.",
    "documentationSite": "Show your users where to go to learn about all the awesome things your plugin can do. Learn how to set this.",
    "reportIssues": "Let users know where to go to request features or report bugs. Learn how to set this.",
    "sourceCode": "Link to the source code to help build trust in your hard work. Learn how to set this.",
    "supportSite": "Make sure your users can find someone to help when they need a hand. Learn how to set this.",

    "twitter": "Link to the Author's Twitter. Learn how to set this.",
    "projectSite": "Link to the Project Site of the Plugin. Learn how to set this."
  }
}
